Revit 2024 API
RebarHandleNameData Members
The RebarHandleNameData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarHandleNameData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCustomHandleTag
 Gets the handle tag for which we need to specify the name.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCustomHandleName
 Sets the name of the handle.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace